java_gui/Java_GUI_README.html
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Simple_OS GUI Java program</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-05 11:44:26 CET"/>
<meta name="author" content="Ola Dahl"/>
</head><body>
<h1 class="title">Simple_OS GUI Java program</h1>


<p>
A GUI Java program is found in this directory. 
</p>
<p>
It can be started with 
</p>
<pre class="example">
cd java
java GUISimpleOS
</pre>

<p>
The program communicates with a Simple_OS application using TCP/IP
</p>
<p>
Port number 2000 is used
</p>
<p>
The current version supports communication within the same computer
</p>
<p>
Communication with a Beagleboard running Simple_OS can be done using a bridge
program. An example bridge program is found in the file
</p>
<p>
<a href="../simple_os_apps/tcp_serial/tcp_serial_redirect_mod.py">file:../simple_os_apps/tcp_serial/tcp_serial_redirect_mod.py</a>
</p>
<p>
If a Java SDK is installed, the program can be rebuilt using 
</p>
<pre class="example">
cd java
javac *.java
</pre>

<p>
If you have questions or comments, please contact
Ola Dahl - dahl.ola@gmail.com
</p><div id="postamble"><p class="author"> Author: Ola Dahl
<a href="mailto:dahl dot ola at gmail dot com">&lt;dahl dot ola at gmail dot com&gt;</a>
</p>
<p class="date"> Date: 2013-03-05 11:44:26 CET</p>
<p>HTML generated by org-mode 6.21b in emacs 23</p>
</div></body>
</html>
